mikeakohn/naken_asm/include/8051/stc8a8k64d4.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC8A8K64D4 include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC8A8K64D4
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

S4CON equ 0x84
S4BUF equ 0x85
INTCLKO equ 0x8f
P1M1 equ 0x91
P1M0 equ 0x92
P0M1 equ 0x93
P0M0 equ 0x94
P2M1 equ 0x95
P2M0 equ 0x96
S2CON equ 0x9a
S2BUF equ 0x9b
IRCBAND equ 0x9d
LIRTRIM equ 0x9e
IRTRIM equ 0x9f
BUS_SPEED equ 0xa1
P_SW1 equ 0xa2
SADDR equ 0xa9
WKTCL equ 0xaa
WKTCH equ 0xab
S3CON equ 0xac
S3BUF equ 0xad
TA equ 0xae
IE2 equ 0xaf
P3M1 equ 0xb1
P3M0 equ 0xb2
P4M1 equ 0xb3
P4M0 equ 0xb4
IP2 equ 0xb5
IP2H equ 0xb6
IPH equ 0xb7
SADEN equ 0xb9
P_SW2 equ 0xba
ADC_CONTR equ 0xbc
ADC_RES equ 0xbd
ADC_RESL equ 0xbe
WDT_CONTR equ 0xc1
IAP_DATA equ 0xc2
IAP_ADDRH equ 0xc3
IAP_ADDRL equ 0xc4
IAP_CMD equ 0xc5
IAP_TRIG equ 0xc6
IAP_CONTR equ 0xc7
P5M1 equ 0xc9
P5M0 equ 0xca
P6M1 equ 0xcb
P6M0 equ 0xcc
SPSTAT equ 0xcd
SPCTL equ 0xce
SPDAT equ 0xcf
T4T3M equ 0xd1
T4H equ 0xd2
T4L equ 0xd3
T3H equ 0xd4
T3L equ 0xd5
T2H equ 0xd6
T2L equ 0xd7
CCON equ 0xd8
CMOD equ 0xd9
CCAPM0 equ 0xda
CCAPM1 equ 0xdb
CCAPM2 equ 0xdc
ADCCFG equ 0xde
IP3 equ 0xdf
P7M1 equ 0xe1
P7M0 equ 0xe2
DPS equ 0xe3
DPL1 equ 0xe4
DPH1 equ 0xe5
CMPCR1 equ 0xe6
CMPCR2 equ 0xe7
CL equ 0xe9
CCAP0L equ 0xea
CCAP1L equ 0xeb
CCAP2L equ 0xec
IP3H equ 0xee
AUXINTIF equ 0xef
PWMSET equ 0xf1
PCA_PWM0 equ 0xf2
PCA_PWM1 equ 0xf3
PCA_PWM2 equ 0xf4
IAP_TPS equ 0xf5
PWMCFG equ 0xf6
CH equ 0xf9
CCAP0H equ 0xfa
CCAP1H equ 0xfb
CCAP2H equ 0xfc
RSTCFG equ 0xff

; bit aliases

TF1 equ 0x88+7
TR1 equ 0x88+6
TF0 equ 0x88+5
TR0 equ 0x88+4
IE1 equ 0x88+3
IT1 equ 0x88+2
IE0 equ 0x88+1
IT0 equ 0x88+0
SM0 equ 0x98+7
SM1 equ 0x98+6
SM2 equ 0x98+5
REN equ 0x98+4
TB8 equ 0x98+3
RB8 equ 0x98+2
TI equ 0x98+1
RI equ 0x98+0
EA equ 0xa8+7
ELVD equ 0xa8+6
EADC equ 0xa8+5
ES equ 0xa8+4
ET1 equ 0xa8+3
EX1 equ 0xa8+2
ET0 equ 0xa8+1
EX0 equ 0xa8+0
PPCA equ 0xb8+7
PLVD equ 0xb8+6
PADC equ 0xb8+5
PS equ 0xb8+4
PT1 equ 0xb8+3
PX1 equ 0xb8+2
PT0 equ 0xb8+1
PX0 equ 0xb8+0
CY equ 0xd0+7
AC equ 0xd0+6
F0 equ 0xd0+5
RS1 equ 0xd0+4
RS0 equ 0xd0+3
OV equ 0xd0+2
P equ 0xd0+0
CF equ 0xd8+7
CR equ 0xd8+6
CCF3 equ 0xd8+3
CCF2 equ 0xd8+2
CCF1 equ 0xd8+1
CCF0 equ 0xd8+0

; xdata

PWMC equ 0xff00
PWMCH equ 0xff00
PWMCL equ 0xff01
PWMCKS equ 0xff02
PWMTADC equ 0xff03
PWMTADCH equ 0xff03
PWMTADCL equ 0xff04
PWMIF equ 0xff05
PWMFDCR equ 0xff06
PWMDELSEL equ 0xff07
PWM0T1 equ 0xff10
PWM0T1H equ 0xff10
PWM0T1L equ 0xff11
PWM0T2 equ 0xff12
PWM0T2H equ 0xff12
PWM0T2L equ 0xff13
PWM0CR equ 0xff14
PWM0HLD equ 0xff15
PWM1T1 equ 0xff18
PWM1T1H equ 0xff18
PWM1T1L equ 0xff19
PWM1T2 equ 0xff1a
PWM1T2H equ 0xff1a
PWM1T2L equ 0xff1b
PWM1CR equ 0xff1c
PWM1HLD equ 0xff1d
PWM2T1 equ 0xff20
PWM2T1H equ 0xff20
PWM2T1L equ 0xff21
PWM2T2 equ 0xff22
PWM2T2H equ 0xff22
PWM2T2L equ 0xff23
PWM2CR equ 0xff24
PWM2HLD equ 0xff25
PWM3T1 equ 0xff28
PWM3T1H equ 0xff28
PWM3T1L equ 0xff29
PWM3T2 equ 0xff2a
PWM3T2H equ 0xff2a
PWM3T2L equ 0xff2b
PWM3CR equ 0xff2c
PWM3HLD equ 0xff2d
PWM4T1 equ 0xff30
PWM4T1H equ 0xff30
PWM4T1L equ 0xff31
PWM4T2 equ 0xff32
PWM4T2H equ 0xff32
PWM4T2L equ 0xff33
PWM4CR equ 0xff34
PWM4HLD equ 0xff35
PWM5T1 equ 0xff38
PWM5T1H equ 0xff38
PWM5T1L equ 0xff39
PWM5T2 equ 0xff3a
PWM5T2H equ 0xff3a
PWM5T2L equ 0xff3b
PWM5CR equ 0xff3c
PWM5HLD equ 0xff3d
PWM6T1 equ 0xff40
PWM6T1H equ 0xff40
PWM6T1L equ 0xff41
PWM6T2 equ 0xff42
PWM6T2H equ 0xff42
PWM6T2L equ 0xff43
PWM6CR equ 0xff44
PWM6HLD equ 0xff45
PWM7T1 equ 0xff48
PWM7T1H equ 0xff48
PWM7T1L equ 0xff49
PWM7T2 equ 0xff4a
PWM7T2H equ 0xff4a
PWM7T2L equ 0xff4b
PWM7CR equ 0xff4c
PWM7HLD equ 0xff4d
CKSEL equ 0xfe00
CLKDIV equ 0xfe01
IRC24MCR equ 0xfe02
XOSCCR equ 0xfe03
IRC32KCR equ 0xfe04
MCLKOCR equ 0xfe05
IRCDB equ 0xfe06
P0PU equ 0xfe10
P1PU equ 0xfe11
P2PU equ 0xfe12
P3PU equ 0xfe13
P4PU equ 0xfe14
P5PU equ 0xfe15
P6PU equ 0xfe16
P7PU equ 0xfe17
P0NCS equ 0xfe18
P1NCS equ 0xfe19
P2NCS equ 0xfe1a
P3NCS equ 0xfe1b
P4NCS equ 0xfe1c
P5NCS equ 0xfe1d
P6NCS equ 0xfe1e
P7NCS equ 0xfe1f
P0SR equ 0xfe20
P1SR equ 0xfe21
P2SR equ 0xfe22
P3SR equ 0xfe23
P4SR equ 0xfe24
P5SR equ 0xfe25
P6SR equ 0xfe26
P7SR equ 0xfe27
P0DR equ 0xfe28
P1DR equ 0xfe29
P2DR equ 0xfe2a
P3DR equ 0xfe2b
P4DR equ 0xfe2c
P5DR equ 0xfe2d
P6DR equ 0xfe2e
P7DR equ 0xfe2f
P0IE equ 0xfe30
P1IE equ 0xfe31
P2IE equ 0xfe32
P3IE equ 0xfe33
P4IE equ 0xfe34
P5IE equ 0xfe35
P6IE equ 0xfe36
P7IE equ 0xfe37
LCMIFCFG equ 0xfe50
LCMIFCFG2 equ 0xfe51
LCMIFCR equ 0xfe52
LCMIFSTA equ 0xfe53
LCMIFDATL equ 0xfe54
LCMIFDATH equ 0xfe55
I2CCFG equ 0xfe80
I2CMSCR equ 0xfe81
I2CMSST equ 0xfe82
I2CSLCR equ 0xfe83
I2CSLST equ 0xfe84
I2CSLADR equ 0xfe85
I2CTXD equ 0xfe86
I2CRXD equ 0xfe87
I2CMSAUX equ 0xfe88
TM2PS equ 0xfea2
TM3PS equ 0xfea3
TM4PS equ 0xfea4
ADCTIM equ 0xfea8
ADCEXCFG equ 0xfead
CMPEXCFG equ 0xfeae
P0INTE equ 0xfd00
P1INTE equ 0xfd01
P2INTE equ 0xfd02
P3INTE equ 0xfd03
P4INTE equ 0xfd04
P5INTE equ 0xfd05
P6INTE equ 0xfd06
P7INTE equ 0xfd07
P0INTF equ 0xfd10
P1INTF equ 0xfd11
P2INTF equ 0xfd12
P3INTF equ 0xfd13
P4INTF equ 0xfd14
P5INTF equ 0xfd15
P6INTF equ 0xfd16
P7INTF equ 0xfd17
P0IM0 equ 0xfd20
P1IM0 equ 0xfd21
P2IM0 equ 0xfd22
P3IM0 equ 0xfd23
P4IM0 equ 0xfd24
P5IM0 equ 0xfd25
P6IM0 equ 0xfd26
P7IM0 equ 0xfd27
P0IM1 equ 0xfd30
P1IM1 equ 0xfd31
P2IM1 equ 0xfd32
P3IM1 equ 0xfd33
P4IM1 equ 0xfd34
P5IM1 equ 0xfd35
P6IM1 equ 0xfd36
P7IM1 equ 0xfd37
P0WKUE equ 0xfd40
P1WKUE equ 0xfd41
P2WKUE equ 0xfd42
P3WKUE equ 0xfd43
P4WKUE equ 0xfd44
P5WKUE equ 0xfd45
P6WKUE equ 0xfd46
P7WKUE equ 0xfd47
CCAPM3 equ 0xfd54
CCAP3L equ 0xfd55
CCAP3H equ 0xfd56
PCA_PWM3 equ 0xfd57
PIN_IP equ 0xfd60
PIN_IPH equ 0xfd61
CHIPID0 equ 0xfde0
CHIPID1 equ 0xfde1
CHIPID2 equ 0xfde2
CHIPID3 equ 0xfde3
CHIPID4 equ 0xfde4
CHIPID5 equ 0xfde5
CHIPID6 equ 0xfde6
CHIPID7 equ 0xfde7
CHIPID8 equ 0xfde8
CHIPID9 equ 0xfde9
CHIPID10 equ 0xfdea
CHIPID11 equ 0xfdeb
CHIPID12 equ 0xfdec
CHIPID13 equ 0xfded
CHIPID14 equ 0xfdee
CHIPID15 equ 0xfdef
CHIPID16 equ 0xfdf0
CHIPID17 equ 0xfdf1
CHIPID18 equ 0xfdf2
CHIPID19 equ 0xfdf3
CHIPID20 equ 0xfdf4
CHIPID21 equ 0xfdf5
CHIPID22 equ 0xfdf6
CHIPID23 equ 0xfdf7
CHIPID24 equ 0xfdf8
CHIPID25 equ 0xfdf9
CHIPID26 equ 0xfdfa
CHIPID27 equ 0xfdfb
CHIPID28 equ 0xfdfc
CHIPID29 equ 0xfdfd
CHIPID30 equ 0xfdfe
CHIPID31 equ 0xfdff
MD3 equ 0xfcf0
MD2 equ 0xfcf1
MD1 equ 0xfcf2
MD0 equ 0xfcf3
MD5 equ 0xfcf4
MD4 equ 0xfcf5
dwOP1 equ 0xfcf0
wOP1 equ 0xfcf2
wOP2 equ 0xfcf4
ARCON equ 0xfcf6
OPCON equ 0xfcf7
DMA_ADC_CFG equ 0xfa10
DMA_ADC_CR equ 0xfa11
DMA_ADC_STA equ 0xfa12
DMA_ADC_RXA equ 0xfa17
DMA_ADC_RXAH equ 0xfa17
DMA_ADC_RXAL equ 0xfa18
DMA_ADC_CFG2 equ 0xfa19
DMA_ADC_CHSW0 equ 0xfa1a
DMA_ADC_CHSW1 equ 0xfa1b
DMA_SPI_CFG equ 0xfa20
DMA_SPI_CR equ 0xfa21
DMA_SPI_STA equ 0xfa22
DMA_SPI_AMT equ 0xfa23
DMA_SPI_DONE equ 0xfa24
DMA_SPI_TXA equ 0xfa25
DMA_SPI_TXAH equ 0xfa25
DMA_SPI_TXAL equ 0xfa26
DMA_SPI_RXA equ 0xfa27
DMA_SPI_RXAH equ 0xfa27
DMA_SPI_RXAL equ 0xfa28
DMA_SPI_CFG2 equ 0xfa29
DMA_UR1T_CFG equ 0xfa30
DMA_UR1T_CR equ 0xfa31
DMA_UR1T_STA equ 0xfa32
DMA_UR1T_AMT equ 0xfa33
DMA_UR1T_DONE equ 0xfa34
DMA_UR1T_TXA equ 0xfa35
DMA_UR1T_TXAH equ 0xfa35
DMA_UR1T_TXAL equ 0xfa36
DMA_UR1R_CFG equ 0xfa38
DMA_UR1R_CR equ 0xfa39
DMA_UR1R_STA equ 0xfa3a
DMA_UR1R_AMT equ 0xfa3b
DMA_UR1R_DONE equ 0xfa3c
DMA_UR1R_RXA equ 0xfa3d
DMA_UR1R_RXAH equ 0xfa3d
DMA_UR1R_RXAL equ 0xfa3e
DMA_UR2T_CFG equ 0xfa40
DMA_UR2T_CR equ 0xfa41
DMA_UR2T_STA equ 0xfa42
DMA_UR2T_AMT equ 0xfa43
DMA_UR2T_DONE equ 0xfa44
DMA_UR2T_TXA equ 0xfa45
DMA_UR2T_TXAH equ 0xfa45
DMA_UR2T_TXAL equ 0xfa46
DMA_UR2R_CFG equ 0xfa48
DMA_UR2R_CR equ 0xfa49
DMA_UR2R_STA equ 0xfa4a
DMA_UR2R_AMT equ 0xfa4b
DMA_UR2R_DONE equ 0xfa4c
DMA_UR2R_RXA equ 0xfa4d
DMA_UR2R_RXAH equ 0xfa4d
DMA_UR2R_RXAL equ 0xfa4e
DMA_UR3T_CFG equ 0xfa50
DMA_UR3T_CR equ 0xfa51
DMA_UR3T_STA equ 0xfa52
DMA_UR3T_AMT equ 0xfa53
DMA_UR3T_DONE equ 0xfa54
DMA_UR3T_TXA equ 0xfa55
DMA_UR3T_TXAH equ 0xfa55
DMA_UR3T_TXAL equ 0xfa56
DMA_UR3R_CFG equ 0xfa58
DMA_UR3R_CR equ 0xfa59
DMA_UR3R_STA equ 0xfa5a
DMA_UR3R_AMT equ 0xfa5b
DMA_UR3R_DONE equ 0xfa5c
DMA_UR3R_RXA equ 0xfa5d
DMA_UR3R_RXAH equ 0xfa5d
DMA_UR3R_RXAL equ 0xfa5e
DMA_UR4T_CFG equ 0xfa60
DMA_UR4T_CR equ 0xfa61
DMA_UR4T_STA equ 0xfa62
DMA_UR4T_AMT equ 0xfa63
DMA_UR4T_DONE equ 0xfa64
DMA_UR4T_TXA equ 0xfa65
DMA_UR4T_TXAH equ 0xfa65
DMA_UR4T_TXAL equ 0xfa66
DMA_UR4R_CFG equ 0xfa68
DMA_UR4R_CR equ 0xfa69
DMA_UR4R_STA equ 0xfa6a
DMA_UR4R_AMT equ 0xfa6b
DMA_UR4R_DONE equ 0xfa6c
DMA_UR4R_RXA equ 0xfa6d
DMA_UR4R_RXAH equ 0xfa6d
DMA_UR4R_RXAL equ 0xfa6e
DMA_LCM_CFG equ 0xfa70
DMA_LCM_CR equ 0xfa71
DMA_LCM_STA equ 0xfa72
DMA_LCM_AMT equ 0xfa73
DMA_LCM_DONE equ 0xfa74
DMA_LCM_TXA equ 0xfa75
DMA_LCM_TXAH equ 0xfa75
DMA_LCM_TXAL equ 0xfa76
DMA_LCM_RXA equ 0xfa77
DMA_LCM_RXAH equ 0xfa77
DMA_LCM_RXAL equ 0xfa78
